package google.yousefi.cryptoapp.common

/**
 * کلاسی که نتیجه عملیات را مشخص می‌کند، می‌تواند موفقیت‌آمیز یا همراه با خطا باشد.
 *
 * @param T نوع داده‌ای که نتیجه عملیات را نگه‌داری می‌کند.
 */
sealed class Result<T> {
    /**
     * کلاسی که نشان‌دهنده موفقیت در عملیات است و داده‌های مورد نظر را نگه‌داری می‌کند.
     *
     * @param T نوع داده‌ای که در نتیجه موفقیت‌آمیز عملیات وجود دارد.
     * @property data داده‌ای که نتیجه موفقیت‌آمیز عملیات را نشان می‌دهد.
     */
    class Success<T>(val data: T) : Result<T>()

    /**
     * کلاسی که نشان‌دهنده خطا در عملیات است و پیام خطا را نگه‌داری می‌کند.
     *
     * @param T نوع داده‌ای که در نتیجه عملیات وجود دارد.
     * @property message پیام خطایی که در نتیجه عملیات وجود دارد.
     */
    class Error<T>(val message: String?) : Result<T>()
}

